import 'dart:io';
import 'dart:convert';
import 'package:dart_shopping_mall_code/Product.dart';

class ShoppingMall {
  void hall() {
    print(
      '-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------',
    );

    stdout.write(
      '[1] 상품 목록 보기 / [2] 장바구니에 담기 / [3] 장바구니에 담긴 상품의 총 가격 보기 / [4] 프로그램 종료\n',
    );

    print(
      '-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------',
    );

    final input = stdin.readLineSync(encoding: utf8);

    switch (input) {
      case "1":
        final goods = Product();
        mall.hall();

      case "2":
      // [2] 장바구니에 담기
      case "3":
      // [3] 장바구니에 담긴 상품의 총 가격 보기
      case "4":
      // [4] 프로그램 종료
      case "6":
        Defalt:
        print('잘못된 입력 값입니다.');
    }

    print('$input을 선택 하셨습니다 상품목록을 불러 옵니다.');
  }
}
